const comments = {
    '休闲滑板车': {
        part: {
            '完课鼓励': `例：XXX小朋友你好哦~你准时地完成了这次《休闲滑板车》课程的学习,很棒哦！
                    例：XXX小朋友你好哦~这么快就完成了《休闲滑板车》这节课的学习，你学得很快哦！
                    例：XXX小朋友你好哦！老师看到你的作品喽！恭喜你完成了又一次新课程的学习！
                    例：XXX小朋友你好哦！看到你这节课的作品老师真开心！`,
            '作品描述': `例：老师看到你在作品中给皮皮和小卡搭编写了程序，让他们点击之后可以移动起来了！也添加了小喇叭，点击之后可以播放音乐！说明你运用了这次课程中点击积木、移动积木和音乐播放积木！
                    例：老师看到你完成了这次的程序，让皮皮和小卡搭都可以踩着滑板车前进啦！并且作品里面的音乐也很好听哦！说明你在程序中使用了这次课程里面点击积木、移动积木和音乐播放积木了！`,
            '个性化表扬': `例：老师看到你更换了作品的场景，让皮皮和小卡搭可以在一个跑道上比赛玩滑板车了，非常有想法哦！
                    例：老师看到你还在作品中添加了一个小鸟，也可以向前移动，它是不是也想跟皮皮和小卡搭一起比赛呢？
                    例：老师看到你拼接了好几块移动积木，可以让小卡搭一次走得更远了呢！
                    例：老师看到你还自己探索了积木参数的使用，就是调整了积木旁边的数字，这样就可以让皮皮和小卡搭一次走得更远了呢！
                    例：你的作品让老师眼前一亮，你更换了作品的场景和角色，让皮皮和小卡搭可以开着小车在马路上行驶了，看起来他们一定非常开心！`,
            '问题指出': `例：老师发现小喇叭还不能播放音乐，是不是你还没有来得及给小喇叭编写程序呢？可以给小喇叭再补上程序哦~
                    例：老师发现点击皮皮的时候，皮皮不能向前移动哦，这是为什么呢？因为我们应该把点击积木和移动积木拼接在一起，但是你好像使用的不是点击积木哦~可以再找找点击积木在哪里，修改一下吧~`,
            '提出希望': `例：你已经很好的完成了这次课程的作品，但是老师希望有时间的话你也可以尝试对你的作品来进行改编，比如说尝试一下给作品里面添加新的角色，看还有谁能够向前移动呢？
            例：这次你完成了这么精彩的作品，老师非常期待你的下一次作品哦！希望你可以完成更多有创意的作品！`,
            '引导介绍作品': `例：最后呢，老师希望你能不能也通过拍摄视频也给班级里的其他同学也来介绍一下你精彩的作品呢？比如你可以介绍一下你完成了什么样的作品，使用了哪些角色，完成了什么功能和学到了哪些知识~很期待你的分享哦~`

        },
        all: [
            `XXX小朋友你好哦！老师看到你的作品喽！恭喜你完成了又一次新课程的学习！
            老师看到你完成了这次的程序，让皮皮和小卡搭都可以踩着滑板车前进啦！并且作品里面的音乐也很好听哦！说明你已经掌握这次课程里面点击积木、移动积木和音乐播放积木的用法啦！
            并且你还自己探索了积木参数的使用，就是调整了积木旁边的数字，这样就可以让皮皮和小卡搭一次走得更远了呢！还添加了可爱的小鸟也可以向前移动！
            这次你完成了这么精彩的作品，老师非常期待你的下一次作品哦！希望你可以完成更多有创意的作品！
            最后呢，老师希望你能不能也通过拍摄视频也给班级里的其他同学也来介绍一下你精彩的作品呢？比如你可以介绍一下你完成了什么样的作品，使用了哪些角色，完成了什么功能和学到了哪些知识~很期待你的分享哦~`,

            `XXX小朋友你好哦~这么快就完成了《休闲滑板车》这节课的学习，你学得很快哦！
            老师看到你在作品中给皮皮和小卡搭编写了程序，让他们点击之后可以移动起来了！说明你掌握了这次课程中点击积木、移动积木的使用！
            不过老师发现小喇叭还不能播放音乐，是不是你还没有来得及给小喇叭编写程序呢？可以给小喇叭再补上程序哦~
            老师希望有时间的话你也可以尝试对你的作品来进行改编，比如说尝试一下给作品里面添加新的角色，看还有谁能够向前移动呢？
            另外，你能不能也通过拍摄视频也给班级里的其他同学也来介绍一下你的作品呢？继续加油哦！`
        ]
    }
}
export default comments;
